
tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade'
tap "alextodicescu/tgenv"

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils', Args: ["with-default-names"]

# Install Bash 4
brew 'bash'
brew 'bash-completion2'

# Install zsh
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'


# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', Args: ["with-default-names"]

# Install Binaries
brew 'mas'
brew 'tree'
brew 'wget'
brew 'vim', Args: ["with-override-system-vi"]
brew 'grep', Args: ["with-default-names"]
brew 'ssh-copy-id'
brew 'jq'
brew 'tmux'
brew 'python3'
brew 'gnu-tar', Args: ["with-default-names"]
brew 'htop'
brew 'git'
brew 'watch'
brew 'pv'
brew 'bat'
brew 'packer'
brew "httpie"
brew "speedtest-cli"
brew "subversion"
brew "telnet"
brew "mysql-client" 
brew "ansible"
brew "awscli"
brew "diff-so-fancy"
brew "ripgrep"
brew "tfenv"
brew "alextodicescu/tgenv/tgenv"
brew "unrar"
brew "ruby"
brew "node"
brew "sqlite"
brew "z"

# Apps
cask 'alfred'
cask "appcleaner"
cask 'docker'
cask 'iterm2'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'vscodium'
cask 'spotify'
cask 'firefox'
cask 'nextcloud'
cask 'the-unarchiver'
cask 'postman'
cask "itsycal"
cask "mysqlworkbench"
cask "mark-text"
cask "vnc-viewer"
cask "wireshark"
cask 'sensiblesidebuttons'
cask "scroll-reverser"
cask "alacritty"
cask "aws-vault"
cask 'bbedit'
cask 'maccy'


# Work Apps
# cask 'slack'
# cask 'logitech-unifying'
# cask 'wireshark'
# cask 'vnc-viewer'

# Install Mac App Store Apps

# Work
mas "Microsoft Remote Desktop", id: 715768417
mas "Ethernet Status", id: 1186187538
mas "Magnet", id: 441258766
mas "Amphetamine", id: 937984704
