tap 'buo/cask-upgrade'
tap "alextodicescu/tgenv"

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils', Args: ["with-default-names"]

# Install zsh
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'


# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', Args: ["with-default-names"]

# Install Binaries
brew 'mas'
brew 'tree'
brew 'wget'
brew 'vim', Args: ["with-override-system-vi"]
brew 'grep', Args: ["with-default-names"]
brew 'ssh-copy-id'
brew 'jq'
brew 'tmux'
brew 'python3'
brew 'gnu-tar', Args: ["with-default-names"]
brew 'htop'
brew 'git'
brew 'watch'
brew 'pv'
brew 'bat'
brew 'packer'
brew "httpie"
brew "speedtest-cli"
brew "subversion"
brew "telnet"
brew "mysql-client" 
brew "ansible"
brew "awscli"
brew "diff-so-fancy"
brew "ripgrep"
brew "tfenv"
brew "alextodicescu/tgenv/tgenv"
brew "unrar"
brew "ruby"
brew "node"
brew "sqlite"
brew "z"
brew "bitwarden-cli"
brew "fx"
brew "sngrep"
brew "the_silver_searcher"

# Apps
cask "alfred"
cask "appcleaner"
cask "docker"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "spotify"
cask "firefox"
cask "nextcloud"
cask "the-unarchiver"
cask "itsycal"
cask "mysqlworkbench"
cask "vnc-viewer"
cask "wireshark"
cask "alacritty"
cask "aws-vault"
cask "visual-studio-code" 
cask 'steermouse' 
cask "authy"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "karabiner-elements"
cask "mysqlworkbench"
cask "wireshark"
cask "sequel-ace"
cask "meetingbar"

# Install Mac App Store Apps
mas "Microsoft Remote Desktop", id: 1295203466
mas "Ethernet Status", id: 1186187538
mas "Magnet", id: 441258766
mas "Amphetamine", id: 937984704
mas "Tot", id: 1491071483
