tap 'buo/cask-upgrade'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils', Args: ["with-default-names"]

# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', Args: ["with-default-names"]

# Install Binaries
brew 'mas'
brew 'tree'
brew 'wget'
brew 'vim', Args: ["with-override-system-vi"]
brew 'grep', Args: ["with-default-names"]
brew 'ssh-copy-id'
brew 'jq'
brew 'tmux'
brew 'python3'
brew 'gnu-tar', Args: ["with-default-names"]
brew 'htop'
brew 'git'
brew 'watch'
brew 'pv'
brew 'bat'
brew "httpie"
brew "speedtest-cli"
brew "ansible"
brew "awscli"
brew "diff-so-fancy"
brew "ripgrep"
brew "tfenv"
brew "unrar"
brew "ruby"
brew "node"
brew "sqlite"
brew "z"
brew "bitwarden-cli"
brew "fx"
brew "sngrep"
brew "the_silver_searcher"
brew "pigz"

# Apps
cask "alfred"
cask "appcleaner"
cask "docker"
cask "spotify"
cask "firefox"
cask "nextcloud"
cask "the-unarchiver"
cask "vnc-viewer"
cask "wireshark"
cask "alacritty"
cask "aws-vault"
cask "visual-studio-code" 
cask "steermouse"
cask "authy"
cask "hammerspoon"
cask "iina"

# Install Mac App Store Apps
mas "Amphetamine", id: 937984704
mas "Tot", id: 1491071483
